# Семинар 5. Функция

"""
Как разбивать код на функции?

1. От задачи.
    1) разбиваем задачу на шаги;
    2) анализируем каждый ли шаг целесообразно выделить в функцию.
2. От алгоритма.
    1) строим алгоритм выполнения задачи;
    2) если какие-то последовательности действий в алгоритме повторяются - выделяем в функцию;
    3) если какая-то последовательность действий не зависит от остальных значений в алгоритме - выделяем в функцию
    (например определение простое ли число можно выделить в функцию, тк значения в функции не зависят от алгоритма).

Почитать IDEF0

"""
